---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalFileReference
source: html/9605a7c5-1fca-0201-acf7-23de69f61271.htm
---
# ExternalFileReference Members

Releases all resources used by the ExternalFileReference